const products = [
  {
    id: 1,
    productTitle: "گوشی موبایل سامسونگ مدل A12",
    productPrice: "3,500,000",
    productOffedPrice: "2,500,000",
    productDesc:
      "گوشی A12 یکی دیگر از میان رده‌های شرکت سامسونگ است که در تاریخ 24 نوامبر 2020 معرفی شد. شرکت سامسونگ برای این محصول خود از یک صفحه‌نمایش 6.5 اینچی با رزولوشن 1600 در 720 پیکسل، استفاده کرده است. این صفحه‌نمایش در هر اینچ 264 پیکسل را نشان می‌دهد که از جزئیات و وضوح تصویر خوبی برخوردار است. تراشه‌ این محصول Mediatek MT6765 Helio P35 از تراشه‌های 12 نانومتری سامسونگ است که با پردازنده مرکزی هشت هسته‌ای Cortex-A55 و پردازنده گرافیکی PowerVR GE8320 همراه شده است. این تراشه برای بازکردن چندین برنامه به‌صورت هم‌زمان و تماشای ویدئو مناسب است. این گوشی با 4 گیگابایت رم و 64 گیگابایت حافظه داخلی عرضه شده است و با استفاده از یک کارت حافظه‌ی جانبی قادر خواهید بود.",
    off: 20,
  },
  {
    id: 2,
    productTitle: "هدفون شیائومی مدل K1",
    productPrice: "425,000",
    productOffedPrice: "385,000",
    productDesc: "در دوره‌ای از تاریخ که ما زیست می‌کنیم، نیاز به انرژی خصوصا انرژی الکترونیکی و الکتریکی بسیار مهم و حیاتی است. این نیاز برای وسایلی که امروزه دیگر عضوی از زندگی ما هستند به وجود آمده است. شارژر همراه انکر مدل A1271 PowerCore شارژرهمراهی با ظاهری ساده و مینیمال است. این شارژر ساخته شرکت انکر است که شرکتی بسیار مطرح در زمینه ساخت پاوربانک (شارژرهمراه) است. انکر در تولید این محصولات یک باتری با ظرفیت ۲۰۱۰۰ میلی‌آمپر ساعت به‌کاربرده که قادر است با یکبار شارژ، باتری یک آیفون ۶ را بیش از ۷ مرتبه شارژ کند. در این محصول از تکنولوژی شارژ سریع Power IQ بهره گرفته شده‌است. همان‌طور که از نام این تکنولوژی پیداست، شما می‌توانید با استفاده از آن باتری گوشی موبایل یا تبلت خود را با سرعت بیشتر از پاور بانک‌های معمولی شارژ کنید. ولتاژ ورودی و خروجی در این محصول ۵ ولت و شدت جریان ورودی آن هم ۲ آمپر است. این محصول ۳۵۶ گرم وزن دارد و بدنه‌ آن به‌صورت مستطیل طراحی شده‌است.",
    off: 10,
  },
  {
    id: 3,
    productTitle: "پاوربانک 20000 میلی آمپر",
    productPrice: "853,000",
    productOffedPrice: "800,000",
    productDesc: "داشتن یک ایربادز بی‌سیم خیلی کارآمد خواهد بود. به شما این امکان را می‌دهد که بدون دردسر موسیقی، کتاب صوتی و پادکست گوش کنید. دیگر مشکل سیم نخواهید داشت. در بین ایربادزهای بی‌سیم، اپل محصول خوبی راهی بازار کرده است. ایربادزهای اپل اما قیمت بسیار بالایی دارند و شاید کمتر کسی بخواهد برای داشتن یک ایربادز بی‌سیم این همه هزینه کند. اینجاست که شرکت شیائومی دست به کار شد و یک ایربادز ارزان قیمت راهی بازار کرده است. ایربادز «ردمی ایرداتس» یک محصول با کیفیت با قیمتی بسیار مناسب است.",
    off: 1,
  },
  {
    id: 4,
    productTitle: "لبتاپ ایسر مدل G75",
    productPrice: "38,250,000",
    productOffedPrice: "38,250,000",
    productDesc:
      "شرکت «ایسر» یکی از شرکت‌های فعال در زمینه‌ی تولید لپ‌تاپ است که طیف وسیع محصولاتش براساس نیاز مشتری ساخته شده و این یکی از ویژگی‌هایی است که باعث شده این شرکت در ایران طرفداران زیادی داشته باشد. لپ‌تاپ مدل «Aspire A315-57G-559W» یکی از مدل‌های زیبا، ظریف و بسیار باکیفیت است. پردازنده‌ی مرکزی i5 اینتل با مدل 1035G1 محاسبات را برعهده دارد. هشت گیگابایت حافظه‌ی رم و 1Tra حافظه‌ی داخلی از نوع‌ HDD برای ذخیره و نقل‌و‌انتقال اطلاعات استفاده می‌شود و مناسب به‌نظر می‌رسد. پردازش‌های گرافیکی این لپ‌تاپ توسط پردازنده شرکت انویدیا مدل Geforce mx330 انجام می‌شود که و برای کارهای گرافیکی و بازی‌های معمول می‌توانید روی آن حساب کنید. صفحه‌ نمایش این محصول 15.6اینچی با دقت‌ FHD است و روکش ماتش هنگام کار در محیط‌های باز و تابش مستقیم نور آفتاب ممکن است . این دستگاه از لپ‌تاپ‌های نسبتا باریک ایسر است",
    off: 0,
  },
];

const getProducts = () => {
  return new Promise((resolve, reject) => {
    setTimeout(() => resolve(products), 2000);
  });
};

const getSingleProduct = (pId) => {
  return new Promise((resolve, reject) => {
    setTimeout(
      () => resolve(products.filter((product) => product.id === pId)),
      2000
    );
  });
};

export { getProducts, getSingleProduct };
